st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Projects/STM32F072RB-Nucleo/Applications/USB_PD/MB1303_Provider_RTOS/Src/usbpd_dpm.c
#endif /* USBPD_DPM_PRS */

#ifdef USBPD_CLI
static char cli_text[CLI_OUTPUT_MAX_SIZE];
#endif
/* Private functions ---------------------------------------------------------*/
USBPD_StatusTypeDef USBPD_DPM_RequestNewPowerProfile(uint8_t PortNum, uint8_t PDOIndex);
static int32_t DPM_FindVoltageIndex(uint32_t PortNum, USBPD_SNKPowerRequest_TypeDef* PtrRequestedPower);
USBPD_StatusTypeDef DPM_SetSNKRequiredPower(uint8_t PortNum, uint32_t Current, uint32_t Voltage, uint32_t MaxVoltage, uint32_t MinVoltage);

/**
  * @brief  Initialize DPM for a provider port power role (port power role, PWR_IF, CAD and PE Init procedures)
  * @param  None
  * @retval USBPD status
  */
USBPD_StatusTypeDef USBPD_DPM_Init(void)
{
  uint32_t index = 0;

  memset(&DPM_Ports, 0, sizeof(USBPD_HandleTypeDef) * USBPD_PORT_COUNT);

  DPM_Ports[USBPD_PORT_0].DPM_PortPowerRole = DPM_PORT0_PORTPOWERROLE;
#if USBPD_PORT_COUNT==2
  DPM_Ports[USBPD_PORT_1].DPM_PortPowerRole = DPM_PORT1_PORTPOWERROLE;
#endif /*USBPD_PORT_COUNT==2*/

#ifdef USBPD_LED_SERVER
  /* Led management initialization */
  Led_Init();
#endif /* USBPD_LED_SERVER */
  
  for (index = 0; index<USBPD_PORT_COUNT; index++)
  {
    DPM_Ports[index].DPM_NumberOfRcvSRCPDO = 0;
    DPM_Ports[index].DPM_NumberOfRcvSNKPDO = 0;
    DPM_Ports[index].DPM_RcvRequestDOMsg = 0;
    DPM_Ports[index].DPM_RDOPosition = 0;
    DPM_Ports[index].DPM_RDOPositionPrevious = 0;
    DPM_Ports[index].DPM_RequestDOMsg = 0;
    DPM_Ports[index].DPM_RequestDOMsgPrevious = 0;
    DPM_Ports[index].DPM_RequestedVoltage = 0;
    USBPD_PWR_IF_SetRole(index, DPM_Ports[index].DPM_PortPowerRole);

#ifdef USBPD_LED_SERVER
    /* LED according to the role */
    Led_Set(DPM_Leds[index].Role, LED_MODE_FromPowerRole(DPM_Ports[index].DPM_PortPowerRole), 0);
#endif /* USBPD_LED_SERVER */
  }

#ifdef USBPD_CLI
#ifndef HAL_UART_MODULE_ENABLED
#error "To enable the CLI you need the HAL_UART_MODULE_ENABLED"
#endif

  /* CLI enabling */
  CLI_Init(BSP_USART_GetHandle());
  CLI_Run();
#endif /* USBPD_CLI */  

  /* PWR SET UP */
  USBPD_PWR_IF_Init();
  USBPD_PWR_IF_PowerResetGlobal();
  
  /* PE SET UP : Port 0 */
  USBPD_PE_Init(USBPD_PORT_0, DPM_Ports[USBPD_PORT_0].DPM_PortPowerRole, dpmCallbacks);
#if USBPD_PORT_COUNT == 2
  /* PE SET UP : Port 1 */
  USBPD_PE_Init(USBPD_PORT_1, DPM_Ports[USBPD_PORT_1].DPM_PortPowerRole, dpmCallbacks);
#endif /* USBPD_PORT_COUNT == 2 */

  /* CAD SET UP */
  USBPD_CAD_Init(USBPD_PORT_0, CAD_cbs);
#if USBPD_PORT_COUNT == 2
    /* CAD SET UP */
  USBPD_CAD_Init(USBPD_PORT_1, CAD_cbs);
#endif /* USBPD_PORT_COUNT == 2 */
    
  /* Enable CAD on Port 0 */
  USBPD_CAD_PortEnable(USBPD_PORT_0, USBPD_CAD_ENABLE);
#if USBPD_PORT_COUNT == 2
  /* Enable CAD on Port 1 */
  USBPD_CAD_PortEnable(USBPD_PORT_1, USBPD_CAD_ENABLE);
#endif /* USBPD_PORT_COUNT == 2 */
  
  /* create the CAD task */
  osThreadDef(CADTask, USBPD_CAD_Task, osPriorityLow, 0, configMINIMAL_STACK_SIZE * 2);
  CADTaskHandle = osThreadCreate(osThread(CADTask), NULL);
  
  /* PE task to be created on attachment */
  DPM_Ports[USBPD_PORT_0].PE_TaskHandle = NULL;
#if USBPD_PORT_COUNT==2
  DPM_Ports[USBPD_PORT_1].PE_TaskHandle = NULL;
#endif /* USBPD_PORT_COUNT == 2 */
  
  return USBPD_OK;
}

/**
  * @brief  Main tasks for PE layer
  * @param  argument: pointer to the PortNum
  * @retval None
  */
void USBPD_PE_Task(void const *argument)
{
  /* Get the port number passed as parameter */
  uint8_t PortNum = USBPD_PORT_0;
#if USBPD_PORT_COUNT>=2
  if (argument)
  {
    PortNum = *(uint8_t *)argument;
  }
#endif

  for(;;)
  {
    /* PE Source process */
    USBPD_PE_SRCProcess(PortNum);
    osDelay(1);
  }
}

/**
  * @brief  Main task for CAD layer
  * @param  argument Not used
  * @retval None
  */
void USBPD_CAD_Task(void const *argument)
{
  for(;;)
  {
    USBPD_CAD_Process();
    osDelay(CAD_Task_delay);
  }
}

/**
  * @brief  CallBack reporting events on a specified port from CAD layer.
  * @param  PortNum The handle of the port
  * @param  State CAD state
  * @param  Cc	The Communication Channel for the USBPD communication
  * @retval None
  */
void USBPD_CAD_Callback(uint8_t PortNum, USBPD_CAD_STATE State, CCxPin_TypeDef Cc)
{
  /* check the port */
  assert_param(USBPD_PORT_IsValid(PortNum));

  /* get the current role from PE */    
  USBPD_PortPowerRole_TypeDef current_role = PE_GetPowerRole(PortNum);

  switch(State)
  {
  case USBPD_CAD_STATE_ATTACHED:
  case USBPD_CAD_STATE_ATTEMC:

#ifdef USBPD_LED_SERVER
    /* Led feedback */
    Led_Set(DPM_Leds[PortNum].CCLine, LED_MODE_BLINK_CC(Cc), 0);
    Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_BLINK_VBUS, 0);
    Led_Set(DPM_Leds[PortNum].Role, (current_role == USBPD_PORTPOWERROLE_SRC ? LED_MODE_BLINK_ROLE_SRC : LED_MODE_BLINK_ROLE_SNK), 0);
#endif /* USBPD_LED_SERVER */

    /* In case Port role is provider only, Turn on power is executed in DPM callback */
    if (current_role == USBPD_PORTPOWERROLE_SRC)
    { 
         /* Goal is to delay first src_cap */
        osDelay(15);  
    }
    
    DPM_Ports[PortNum].DPM_IsConnected = 1;
    USBPD_PE_IsCableConnected(PortNum, 1);
    
    USBPD_PRL_Reset(PortNum);
    
    /* Create PE task */
    if(DPM_Ports[PortNum].PE_TaskHandle == NULL)
    {
      osThreadDef(PETaskPORT, USBPD_PE_Task, osPriorityHigh, 0, configMINIMAL_STACK_SIZE * 3);
      DPM_Ports[PortNum].PE_TaskHandle = osThreadCreate(osThread(PETaskPORT), (void *)&PortNum);
    }

#ifdef USBPD_CLI
    /* prepare the attached output */
    sprintf(cli_text,  "\r\n*** [%d] attached on CC%d ", PortNum, Cc);
    strcat(cli_text, current_role == USBPD_PORTPOWERROLE_SRC ? "(Source)" : "(Sink)");
    if (DPM_Ports[PortNum].PE_TaskHandle == NULL)
    {
       strcat(cli_text, "(PE is not started!)"); 
    }
    strcat(cli_text, "\r\n");
    CLI_Async_Notify(cli_text);
#endif /* USBPD_CLI */
    break;
    
  case USBPD_CAD_STATE_EMC:
    break;
    
  case USBPD_CAD_STATE_DETACHED:
    if (current_role == USBPD_PORTPOWERROLE_SRC)
    { 
      /* Disable VBUS */
      USBPD_DPM_TurnOffPower(PortNum, PE_GetPowerRole(PortNum));

      /* Disable VCONN*/
      USBPD_PWR_IF_Enable_VConn(PortNum, CCNONE);

      /* a delay to be sure of the turn power off */
      osDelay(10);
    }

    /* The port pair is detached */
    USBPD_PE_IsCableConnected(PortNum, 0);
    
