st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Projects/STM32F072RB-Nucleo/Applications/USB_PD/MB1303_Provider_RTOS/Src/usbpd_dpm.c
    /* Terminate PE task */
    if (DPM_Ports[PortNum].PE_TaskHandle != NULL)
    {
      osThreadTerminate(DPM_Ports[PortNum].PE_TaskHandle);
      DPM_Ports[PortNum].PE_TaskHandle = NULL;
    }
    
    /* perform a reset of all layer in any case */
    USBPD_PE_Reset(PortNum);

    /* Set the disconnection status */
    DPM_Ports[PortNum].DPM_IsConnected = 0;

#ifdef USBPD_CLI
    if (State == USBPD_CAD_STATE_DETACHED)
    {
      sprintf(cli_text, "\r\n*** [%d] detached\r\n", PortNum);
      CLI_Async_Notify(cli_text);
    }
#endif /* USBPD_CLI */
    
#ifdef USBPD_LED_SERVER
    /* Led feedback */
    Led_Set(DPM_Leds[PortNum].CCLine, LED_MODE_OFF, 0);
    Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_OFF, 0);

    /* Check port role to initialize Role LED*/
    Led_Set(DPM_Leds[PortNum].Role, LED_MODE_FromPowerRole(DPM_Ports[PortNum].DPM_PortPowerRole), 0);
#endif /* USBPD_LED_SERVER */
    break;
    
  case USBPD_CAD_STATE_ACCESSORY:
#ifdef USBPD_CLI
    sprintf(cli_text, "\r\n*** [%d] attached: audio accessory not supported\r\n", PortNum);
    CLI_Async_Notify(cli_text);
#endif /* USBPD_CLI */    
    break;
    
  case USBPD_CAD_STATE_DEBUG:
#ifdef USBPD_CLI
    sprintf(cli_text, "\r\n*** [%d] attached: debug not supported\r\n", PortNum);
    CLI_Async_Notify(cli_text);
#endif /* USBPD_CLI */    
    break;
  default:
#ifdef USBPD_CLI
    sprintf(cli_text, "\r\n*** [%d] unknown status\r\n", PortNum);
    CLI_Async_Notify(cli_text);
#endif /* USBPD_CLI */    
    break;
  }
}

/**
  * @brief  Callback function called by PE layer when HardReset message received from PRL
  * @param  PortNum The current port number
  * @param  CurrentRole the current role
  * @param  Status status on hard reset event
  * @retval 0 if continue 1 otherwise
  */
static uint32_t USBPD_DPM_HardReset(uint8_t PortNum, USBPD_PortPowerRole_TypeDef CurrentRole, USBPD_HR_Status_TypeDef Status)
{
  HAL_StatusTypeDef res = HAL_OK;
  switch(Status)
  {
  case USBPD_HR_STATUS_START_ACK:
    res = USBPD_HW_IF_HR_Start(PortNum, CurrentRole, ACKNOWLEDGE);
    USBPD_DPM_TurnOffPower(PortNum, CurrentRole);
    break;
  case USBPD_HR_STATUS_START_REQ:
    res = USBPD_HW_IF_HR_Start(PortNum, CurrentRole, REQUEST);
    USBPD_DPM_TurnOffPower(PortNum, CurrentRole);
    break;
  case USBPD_HR_STATUS_WAIT_VBUS_VSAFE0V:
    res = USBPD_HW_IF_HR_CheckVbusVSafe0V(PortNum, CurrentRole);

    /* STUSB1602_CUT_1_2 */
    if (Ports[PortNum].Device_cut == Cut_1)
    {  
      if (res == HAL_OK && CurrentRole == USBPD_PORTPOWERROLE_SNK)
      {
        /* Workaround: To emulate VBus0Safe condition starting from VBus_Presence condition */ 
        osDelay(300);
      }
    }
    break;
  case USBPD_HR_STATUS_COMPLETED:
    res = USBPD_HW_IF_HR_End(PortNum, CurrentRole);
    USBPD_DPM_TurnOnPower(PortNum, CurrentRole);
    break;
  case USBPD_HR_STATUS_FAILED:
    res = USBPD_HW_IF_HR_End(PortNum, CurrentRole);
    break;
  default:
      break;
  }
  
  return res;
}

/**
  * @brief  Request the DPM to go to Error Recovery.
  * @param  PortNum The current port number
  * @retval None
  */
static uint32_t USBPD_DPM_ErrorRecovery (uint8_t PortNum)
{
  HAL_StatusTypeDef res = HAL_ERROR;
  res = USBPD_HW_IF_ErrorRecovery(PortNum);
  return res;
}

/**
  * @brief  Request the DPM to setup the new power level.
  * @param  PortNum The current port number
  * @retval None
  */
static void USBPD_DPM_SetupNewPower(uint8_t PortNum)
{
  uint8_t rdoposition;

  /* Retrieve Request DO position from DPM handle : RDO position in the table of PDO (possible value from 1 to 7) */
  rdoposition = DPM_Ports[PortNum].DPM_RDOPosition;

  /* Check if get the right pdo position */
  if (rdoposition > 0)
  {
    USBPD_PWR_IF_SetProfile(PortNum, rdoposition-1);
  }
  else
  {
    /* Put it to VSafe5V */
    USBPD_PWR_IF_SetProfile(PortNum, 0);
  }
}

/**
  * @brief  Turn Off power supply.
  * @param  PortNum The current port number
  * @retval None
  */
static void USBPD_DPM_TurnOffPower(uint8_t PortNum, USBPD_PortPowerRole_TypeDef Role)
{
  USBPD_PWR_IF_Enable(PortNum, DISABLE, Role);

#ifdef USBPD_LED_SERVER
  Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_OFF, 0);
#endif /* USBPD_LED_SERVER */
}

/**
  * @brief  Turn On power supply.
  * @param  PortNum The current port number
  * @retval None
  */
static void USBPD_DPM_TurnOnPower(uint8_t PortNum, USBPD_PortPowerRole_TypeDef Role)
{
  /* Enable the output */
  USBPD_PWR_IF_Enable(PortNum, ENABLE, Role);

#ifdef USBPD_LED_SERVER
  /* Led feedback */
  Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_BLINK_VBUS, 0);
#endif /* USBPD_LED_SERVER */
}

/**
  * @brief  Callback function called by PE to inform DPM that an Explicit contract is established.
  * @param  PortNum The current port number
  * @retval None
  */
static void USBPD_DPM_ExplicitContractDone(uint8_t PortNum)
{
  /* Turn On VBUS LED when an explicit contract is established */
#ifdef USBPD_LED_SERVER
  Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_ON, 0);
#endif /* USBPD_LED_SERVER */
  
#ifdef USBPD_CLI
  sprintf(cli_text,  "\r\n*** [%d] selected cap #%d\r\n", PortNum, DPM_Ports[PortNum].DPM_RDOPosition);
  CLI_Async_Notify(cli_text);
#endif
  
}

/**
  * @brief  Used to check the vbus status present or not
  * @param  PortNum   Index of current used port
  * @param  CurrentRole the current role
  * @retval Return 1 if the VBus is present otherwise 0
  */
uint16_t timeout_check = 0;
uint16_t tvbusOn_max = 0x113; /*113hex is 275decimal.*/
uint8_t USBPD_DPM_GetVBusStatus(uint8_t PortNum, USBPD_PortPowerRole_TypeDef CurrentRole)
{
  while ((timeout_check < tvbusOn_max) && (STUSB1602_VBUS_Presence_Get(STUSB1602_I2C_Add(PortNum)) == VBUS_below_UVLO_threshold))
  {
    timeout_check = timeout_check + 5;
    HAL_Delay(5);
  }

  if (timeout_check >= tvbusOn_max)
  {
    timeout_check = 0;
    USBPD_DPM_ErrorRecovery(PortNum);
  }
  timeout_check = 0;
  return STUSB1602_VBUS_Presence_Get(STUSB1602_I2C_Add(PortNum)) == VBUS_above_UVLO_threshold ? 1 : 0;
}

/**
  * @brief  DPM callback to allow PE to retrieve information from DPM/PWR_IF.
  * @param  PortNum Port number
  * @param  DataId Type of data to be read from DPM
  *         This parameter can be one of the following values:
  *           @arg @ref USBPD_CORE_DATATYPE_SRC_PDO Source PDO reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_SNK_PDO Sink PDO reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_RCV_SRC_PDO Received Source PDO values reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_RCV_SNK_PDO Received Sink PDO values reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_REQ_VOLTAGE Requested voltage value reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_REQUEST_DO  Request message DO reading requested (from Sink to Source)
  * @param  Ptr Pointer on address where DPM data should be written (u32 pointer)
  * @param  Size Pointer on nb of u32 written by DPM
  * @retval None
  */
static void USBPD_DPM_GetDataInfo(uint8_t PortNum, USBPD_CORE_DataInfoType_TypeDef DataId, uint32_t *Ptr, uint32_t *Size)
{
  uint32_t index = 0;

  assert_param(Ptr);
  assert_param(Size);
  
